ProgettoYii/basic/controllers/FonteController.php

INSERT INTO `Fonte` (`Fonte`, `Indice`, `Argomento`) VALUES ('facta.news', 17.6, 'business and economy, news, media sharing, Personal Sites/Blogs')
---


<<<<<<< HEAD
        $redirectUrl = Url::to(['fonte/visualizza');

        if ($notizia->save()) {
            return $this->redirect($redirectUrl);
=======
        //$redirectUrl = Url::to(['fonte/visualizza');

        if ($fonte->save()) {
            //return $this->redirect($redirectUrl);
>>>>>>> b2fafa1eb30e01264581f1636d39b9bace8f1561
        }
        else
        {
            // Salvataggio fallito, visualizza gli errori
<<<<<<< HEAD
            $errors = $notizia->getErrors();
=======
            $errors = $fonte->getErrors();
>>>>>>> b2fafa1eb30e01264581f1636d39b9bace8f1561
            var_dump($errors);
        }