ProgettoYii/basic/controllers/GestioneNotiziaController.php


        $redirectUrl = Url::to(['gestione-notizia/analisi', 'indice' => $indice]);

        if ($notizia->save()) {
---
INSERT INTO `Notizia` (`Notizia`, `Indice`, `Categoria`, `Argomento`, `Incongruenze`) VALUES ('https://staticfanpage.akamaized.net/wp-content/uploads/sites/34/2023/03/Screenshot-2023-03-26-alle-20.24.23.jpg', 17.8, 'image/jpeg', 'information technology, content delivery, media sharing', 1)


        //$redirectUrl = Url::to(['fonte/visualizza');

        if ($fonte->save()) {
---
INSERT INTO `Fonte` (`Fonte`, `Indice`, `Argomento`) VALUES ('akamaized.net', 17.6, 'information technology, content delivery, mobile communications, Content Servers')